## Задача 2. Проверить, пересекаются ли задачи во времени
### Описание

Создать функцию для проверки пересечения двух задач во времени.

Менеджер задач включает список задач на день, каждая задача имеет время старта и время окончания. Одновременно может выполняться только одна задача, поэтому задачи нужно проверять на пересечение времени выполнения.

Принимаем, что задачи выполняются в один день.

На вход программе подается 4 аргумента: время начала и окончания каждой задачи в часах (на этом этапе, для простоты не будем учитывать минуты). Время начала и окончания вводится в виде числа, например `13` (если задача начинается в 13 часов).

В результате на экран выводится результат типа `boolean`: пересекаются задачи или нет.

Например, для входных данных 1, 3, 5, 6 нужно вывести "Задачи не пересекаются!", а для 12, 16, 14, 18 или 12, 15, 10, 13: "Задачи пересекаются во времени!"


### Реализация
1. Поочередно получить ввод 4 чисел из консоли, используя `Scanner scanner = new Scanner(System.in)` и `Integer.parseInt()`. Для этого вам надо создать 4 переменных типа `int` и сохранить в каждую значание. Перед вводом каждого числа нужно отобразить приглашение на ввод, указывающее какое именно время требуется ввести, например `System.out.println("Введите время начала первой задачи:");`.
2. Создать переменную `boolean intersection`, в которую будет сохранен результат проверки задач на пересечение.
3. Проверить пересекаются ли задачи и сохранить результат в `intersection`.
4. Вывести результат на экран, используя `if (intersection)` и  `System.out.println()`.
