## Задача 2. Расчет площади и длины окружности

### Описание
Напишите программу для вычисления площади и длины произвольной окружности по его радиусу. Напомним, что площадь курга
вычисляется по формуле: `π x R²` (константу π можно считать равной 3.14), а формула вычисления длины: `2 x π x R`.

### Функционал программы
1. Запросите пользователя ввести радиус окружности;
2. Рассчитайте площадь окружности;
3. Рассчитайте длину окружности;
4. Выведите на экран результат вычисления.

### Пример
Пример 1
```
Введите радиус окружности в сантиметрах:
10 <enter>
Площадь окружности: 314 см.кв.
Длина окружности: 62.8 см.
```


Пример 2
```
Введите радиус окружности в сантиметрах:
4 <enter>
Площадь окружности: 12.56 см.кв.
Длина окружности: 12.56 см.
```

### Реализация

1. Создадим новый repl на сайте [repl.it](https://repl.it/repls), как написано в инструкции к выполнению домашней работы.

2. В файле `Main.java` написан следующий код:

```java
class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}
``` 

Строку нужно удалить `System.out.println("Hello world!");`, эту строку нужно удалить:

```java
System.out.println("Hello world!"); //Код сюда
```

3. Для вывода сообщений в консоль используется метод:

```java
System.out.println("Измените сообщение для вывода его в консоли");
```

4. Чтобы читать сообщения из консоли воспользуемся специальным объектом `Scanner` (на следующих лекциях
мы подробнее познакомимся с термином объект). Описание `Scanner` (как ниже) делается только один раз на всю программу:

```java
Scanner scanner = new Scanner(System.in);
```

5. Для того чтобы была возможность в коде использовать класс `Scanner`, нужно обязательно добавить `import` этого класса 
в самое начало файла `Main.java`:

```java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        //Код сюда
    }
}
 ```

6. Чтобы почитать введенную целое число из консоли, нужно написать:

```java
scanner.nextInt();
```

А чтобы прочитать и сохранить введенное значение в программе для дальнейшего использования, нужно написать:

```java
int radius = scanner.nextInt();
```

7. Для рассчета площади окружности нам поднадобиться константа числа Пи. В этой программе мы воспользуемся еще одним
типом данных `double` — это вещественный тип с плавающей запятой, он наиболее подходит для хранения числа Пи, для объявления неизменяемой переменной нужно написать (будем использовать ее внутри метода)

```java
final double Pi = 3.14; 
```

8. Создадим метод, принимающий целое число в качестве аргумента. Назовем его `calculateCicleArea`, он будет рассчитывать площадь окружности и возвращать результат из метода.  Так как число Пи дробное, то и рассчитанная
площадь может получиться так же дробным числом, поэтому наш метод должен возвращать тип данных `double`:

```java
static double calculateCicleArea(int radius) {
    final double Pi = 3.14;
    return Pi * radius * radius;
}
```

9. Создадим еще один метод, принимающий целое число в качестве аргумента, назовем его `calculateCicleLength`.
Он будет рассчитывать длину окружности и возвращать результат из метода.  Так как число Пи дробное, то и рассчитанная
длина может получиться так же дробным числом, поэтому наш метод должно возвращать `double`:

```java
static double calculateCicleLength(int radius) {
    final double Pi = 3.14;
    return 2 * Pi * radius;
}
```

10. В методе `public static void main` запросим у пользователя ввести радиус окружности, который в дальнейшем передадим
в качестве аргумента методу `calculateCicleArea`:

```java
Scanner scanner = new Scanner(System.in);
System.out.println("Введите радиус окружности в сантиметрах:");
int radius = scanner.nextInt();
``` 

11. После чтения значений вызовем метод `calculateCicleArea` для вычисления площади:

```java
double area = calculateCicleArea(radius);
```

12. Далее рассчитаем длину окружности - вызовем метод `calculateCicleLength`:

```java
double length = calculateCicleLength(radius);
```

13. Выведем результат на экран:

```
System.out.println("Площадь окружности: " + area +  " см.кв.");
System.out.println("Длина окружности: " + length +  " см.");
```

11. Завершим работу программы.
