# Домашнее задание к занятию 1.1. Основы синтаксиса - структура программы и условные операторы
## Задача 1. Високосный год.

Написать программу, который будет рассчитывать количество дней в году - это нужно чтобы точно знать продложительность долгосрочных задач или проектов в днях.
Для рассчета количества дней в году требуется знать несколько правил:
- В високросном году 365 дней, в обычном 366
- Високосный год – это год, номер которого делится без остатка на 400 (например 2000 или 2400), либо делится на 4 но не делится на 100 (например 2008, 2096, но не 2100).

### Функционал программы
1. Вывести сообщение в консоли `Введите год в фомрате "yyyy"`.
2. Ввод года в формате `yyyy` (например 2004).
3. Прочитать значение из консоли и рассчитать количество дней
4. Результат работы программы: напечатать в консоли количество дней в году `Количество дней 365` или `Количество дней 366`.

### Пример
Пример 1
- Введите год в фомрате "yyyy"
- 2000 <нажмите enter>
- Количество дней 366

Пример 2
- Введите год в фомрате "yyyy"
- 2018 <нажмите enter>
- Количество дней 365

### Реализация
1. Создадим новый replt.it как написано в инструкции к выполненю домашней работы и зададим название `task1.1.1`
2. В файле `Main.java` написан следующий код:
```
class Main {
  public static void main(String[] args) {
    System.out.println("Hello world!");
  }
}
``` 
Весь код выполнения задачи нужно писать вместо `System.out.println("Hello world!");`:
```
  public static void main(String[] args) {
    System.out.println("Hello world!"); //Код сюда
  }
```
3. Для вывода сообщений в консоль используется метод:
```
System.out.println("Измените сообщение для вывода его в консоли");
```
4. Чтобы читать сообщения из консоли воспользуемся специальным объектом `Scanner` (на следующих слекциях
мы подробнее познакомимся с термином объект)
```
Scanner scanner = new Scanner(System.in);
``` 
5. Чтобы почитать введенную строку из консоли нужно написать:
```
scanner.nextLine();
```
А чтобы прочитать и сохранить, введенное значение, в программе для дальнейшего использования нужно написать:
```
String value = scanner.nextLine();
```
6. Для вычисления, делиться введеное значение на 400, 4 и 100 (как сказано в условиях к программе) нужно преобзовать
введенный год к числу:
```
int year = Integer.parseInt(value);
```
7. Как проверить, високосный ли год? 
Для этого сначала надо проверить делимость на 400, используя `year % 400 == 0`. Специальный оператор `%` - возращает остаток от деления, только если число делиться на цело результат вычисления будет равен 0, иначе вернется остаток от деления.
Если год делится на 400 без остатка, значит в нем точно 366 дней. Если нет, то аналогично проверить делимость на 100: если год делится на 100, то в нем точно 365 дней. И наконец, если год не делится ни на 400, ни на 100, то проверяем делимость на 4: если делится – то 366 дней, иначе 365.
8. Чтобы последовательно проверить делимость введного числа, нужно воспользоваться оператором сравнения `if else`
```
if (year % 400 == 0) {
    System.out.println("Результат вычисления ...");
} elst if ( еще одна проверка year % ) {
  Вывести резульат
} else {
  ...
}

```
9. Завершение работы программы.