## Задача 2. Расчет площади круга и длины его окружности

### Описание
Напишите программу для вычисления площади круга и длины произвольной окружности по заданному радиусу. Напомним, что площадь круга
вычисляется по формуле: `π x R²` (константу π можно считать равной 3.14), а формула вычисления длины его окружности: `2 x π x R`.

### Функционал программы
1. Запросите пользователя ввести радиус окружности;
2. Рассчитайте площадь круга, создав метод для её расчёта;
3. Рассчитайте длину окружности, создав метод для её расчёта;
4. Выведите на экран результат вычисления.

Примечание: ничего страшного, если при выводе у вас после точки идёт очень много цифр.

### Пример
Пример 1
```
Введите радиус окружности в сантиметрах:
10 <enter>
Площадь круга: 314 см.кв.
Длина окружности: 62.8 см.
```


Пример 2
```
Введите радиус окружности в сантиметрах:
4 <enter>
Площадь круга: 50.24 см.кв.
Длина окружности: 25.12 см.
```

### Реализация

1. Создадим новый repl на сайте [repl.it](https://repl.it/repls), как написано в инструкции к выполнению домашней работы.

2. В файле `Main.java` написан следующий код:

```java
class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}
``` 

Эту строку нужно удалить:

```java
System.out.println("Hello world!");
```

3. Для вывода сообщений в консоль используется метод:

```java
System.out.println("Измените сообщение для вывода его в консоли");
```

4. Чтобы читать сообщения из консоли воспользуемся специальным объектом `Scanner` (на следующих лекциях
мы подробнее познакомимся с термином объект). Описание `Scanner` (как ниже) делается только один раз на всю программу:

```java
Scanner scanner = new Scanner(System.in);
```

5. Для того чтобы была возможность в коде использовать класс `Scanner`, нужно обязательно добавить `import` этого класса 
в самое начало файла `Main.java`:

```java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        //Код сюда
    }
}
 ```

6. Чтобы прочитать введенное целое число из консоли, нужно написать:

```java
scanner.nextInt();
```

А чтобы прочитать и сохранить введенное значение в программе для дальнейшего использования, нужно написать:

```java
int radius = scanner.nextInt();
```

7. Для рассчета площади круга нам понадобится константа числа Пи. В этой программе мы воспользуемся еще одним
типом данных `double` — это вещественный тип с плавающей запятой, он наиболее подходит для хранения числа Пи. Для объявления неизменяемого статического поля (будем использовать его внутри метода на следующих шагах) нужно в начале класса написать:

```java
public static final double PI = 3.14; 
```

8. Создадим метод, принимающий целое число в качестве аргумента. Назовем его `calculateCircleArea`, он будет рассчитывать площадь круга и возвращать результат из метода.  Так как число Пи дробное, то и рассчитанная
площадь может получиться так же дробным числом, поэтому наш метод должен возвращать тип данных `double`:

```java
public static double calculateCircleArea(int radius) {
    return PI * radius * radius;
}
```

9. Создадим еще один метод, принимающий целое число в качестве аргумента, назовем его `calculateCircleLength`.
Он будет рассчитывать длину окружности и возвращать результат из метода.  Так как число Пи дробное, то и рассчитанная
длина может получиться так же дробным числом, поэтому наш метод должно возвращать `double`:

```java
public static double calculateCircleLength(int radius) {
    return 2 * PI * radius;
}
```

10. В методе `public static void main` запросим у пользователя ввести радиус окружности, который в дальнейшем передадим
в качестве аргумента методу `calculateCircleArea`:

```java
Scanner scanner = new Scanner(System.in);
System.out.println("Введите радиус окружности в сантиметрах:");
int radius = scanner.nextInt();
``` 

11. После чтения значений вызовем метод `calculateCircleArea` для вычисления площади:

```java
double area = ???;
```

12. Далее рассчитаем длину окружности - вызовем метод `calculateCircleLength`:

```java
double length = ???;
```

13. Выведем результат на экран:

```
System.out.println("Площадь круга: " + area +  " см.кв.");
System.out.println("Длина окружности: " + length +  " см.");
```

11. Завершим работу программы.
