## Задача № 1

А почему бы нам не написать программу для учета товаров на складах?
Основная цель: по серийному номеру товара узнать, на каком складе он хранится.

Итак, у нас есть:
* Товар: номер (уникальный), название, цена;
* Склад: имя (уникальное), адрес;
* Сопоставление идентификатора товара с самим товаром;
* Сопоставление идентификатора склада со складом;
* Сопоставление, на каком складе лежит товар.

Из функциональных требований к программе реализуем:
* Добавление товара;
* Добавление склада;
* Нахождение товара по номеру (вывод информации о товаре и складе, на котором он находится);
* Перевозка товара с одного склада на другой.

### Реализация

1. Создадим классы Product и Storage.

1. Для корректной работы коллекций HashMap и HashSet необходимо переопределить функции `hashCode()` и `equals()` в используемых классах. Так как у товара и у склада есть поля с уникальными значениями (номер у товара и имя у склада), сделать это будет легко! Просто воспользуемся реализацией hashCode и equals этих полей.

Например:
```java
@Override
public boolean equals(Object obj) {
  return name.equals(obj);
}

@Override
public int hashCode() {
  return name.hashCode();
}
```

2. Следующим шагом создадим функции для считывания сущности с клавиатуры, например, для `Product`:

```java
private String readProductId(Scanner scanner) {
  System.out.println("Введите индентификатор продукта:");
  String id = scanner.nextLine();
  return id;
}
private Product readProduct(String id, Scanner scanner) {
  System.out.println("Введите имя продукта:");
  String name = scanner.nextLine();
  // цена с проверкой корректности - неотрицательное число
  return new Product(id, name, price);
}
```

Аналогичным образом создаются функции для ввода имени склада и ввода всей сущности с клавиатуры.

Для вывода объекта на экран переопределим метод `toString()`.

3. Далее необходимо реализовать логику заполнения нашей базы данных:
   1) Запрашиваем ввод идентификатора товара:
      * Если введен несуществующий идентификатор, выдать сообщение "товар %s не найден, создать новый с данным идентификатором?". При положительном ответе считать товар с клавиатуры и сразу же перейти к пункту `2)`, так как товар должен где-то храниться.
      * Если введен существующий идентификатор, вывести информацию о товаре и предложить сменить склад (см. следующий пункт).
   2) После создания / при редактировании товара спросить, на каком складе он находится:
      * Если введено имя существующего склада, переложить его туда.
      * Если введено неизвестное имя склада, предложить его создать по аналогии с товаром.
   3) Повторить с первого пункта до тех пор, пока не будет введен `end`.

4. Для демонстрации работы программы создадим в коде при запуске программы несколько складов (~2) и разложим по ним несколько товаров (~3).
