## Задача 1. Перевод времени
### Описание
Для работы менеджера задач нам нужно сравнивать разные по длительности задачи.

Вам нужно разработать часть фунциональности, отвечающую за перевод времени из одних единиц в другие. Например – на одну задачу нужно 2 дня, 4 часа и 10 минут, на вторую задачу нужно 3 дня, 4 часа и 15 минут. Хранить и использовать три переменные не удобно, поэтому для хранения времени обычно используют минимальную из используемых единиц. В нашем случае это минуты. Например задача занимает 1 день 2 часа 10 минут, а программа переводит и хранит это как 24\*60\*1+60\*2+10=1570 минут. С одной переменной уже гораздо проще выполнять сравнение, сложение и вычитание.

Вам нужно написать программу, которая примет на ввод длительность задачи - 3 числа: число дней, минут и часов. Далее, вам нужно перевести введенное время в минуты. Потом запросить у пользователя в какую величину он хочет перевести результат: `дни`, `часы` или `минуты`, и вывести на экран длительность в соответствующем формате.

### Процесс реализации
1. Используя `Scanner scanner = new Scanner(System.in)` и `scanner.nexInt()` последовательно получить ввод трех чисел и сохранить их в переменные `int days`, `int hours`, `int minutes` для дней, часов и минут соответственно. Перед каждым запросом на ввод нужно выводить сообщение (`System.out.println("...");`), чтобы пользователь понимал, что ему вводить.
2. Создать переменную `int totalTimeMinutes`, вычислить и сохранить туда полное время задачи в минутах.
3. Создать 2 функции `public float convertToDays(int totalTimeMinutes)`, `public float convertToHours(int totalTimeMinutes)`.
4. Получить на ввод единицу измерения времени для вывода: `дни`, `часы` или `минуты`, и сохранить в переменную `String convertTo`.
5. Используя `switch(convertTo)` вызвать необходимую функцию и вывести длительность задачи в выбранном пользователем формате.

### Примеры
Пользователь вводит: 1, 5, 30, дни.

Вывод: 1.23

Пользователь вводит: 0, 0, 120, часы.

Вывод: 2.0
