## Задача 1. Перевод времени

### Описание
Для работы менеджера задач нам нужно сравнивать разные по длительности задачи.

Вам нужно разработать часть функциональности, отвечающую за перевод времени из одних единиц в другие. Например, на одну задачу нужно 2 дня, 4 часа и 10 минут, на вторую задачу нужно 3 дня, 4 часа и 15 минут.

Хранить и использовать три переменные неудобно, поэтому для хранения времени обычно используют минимальную из используемых единиц. В нашем случае это секунды (хотя иногда используют миллисекунды).
> Например, задача занимает 1 день 2 часа 10 минут, а программа переводит и хранит это как `24 * 3600 + 2 * 3600 + 10 * 60 = 94200 секунд.`
С одной переменной уже гораздо проще выполнять сравнение, сложение и вычитание.

Нужно написать программу, которая в цикле запрашивает название задачи и ее продолжительность (3 числа: дни, часы и минуты), подсчитывает, сколько времени потребуется на выполнение всех задач, а также выводит время в секундах самой продолжительной задачи и самой короткой.

### Функционал программы
1. Возможность ввода из консоли нескольких задач:
    1. Название;
    2. Количество дней;
    3. Количество часов;
    4. Количество минут.
2. Завершение программы, если пользователь ввел `end`.
3. Перед завершением программы вывод информации:
    1. Всего потребуется секунд на выполнение всех задач;
    2. Самая продолжительная задача займет XXXX секунд (имя задачи выводить не нужно);
    3. Самая короткая задача займет XXXX секунд (имя задачи выводить не нужно).

### Пример

```
Введите название задачи
"Дизайн главной страницы" <нажмите enter>
Сколько дней потребуется на выполнение?
3 <нажмите enter>
Сколько часов?
5 <нажмите enter>
Сколько минут?
0 <нажмите enter>
Для завершения работы программы введите `end` / для продолжения нажмите enter

...
Введите название задачи
"Верстка footer" <нажмите enter>
Сколько дней потребуется на выполнение?
0 <нажмите enter>
Сколько часов?
4 <нажмите enter>
Сколько минут?
0 <нажмите enter>
Для завершения работы программы введите `end` / для продолжения нажмите enter
end <нажмите enter>


Всего потребуется: 291600 секунд
Самая продолжительная задача займет: 277200 секунд
Самая короткая задача займет: 14400 секунд
```


### Реализация
1. Создадим новый repl на сайте [repl.it](https://repl.it/repls), как написано в инструкции к выполнению домашней работы, и зададим название `homework1.2.1`

2. В файле `Main.java` написан следующий код:

    ```
    class Main {
      public static void main(String[] args) {
        System.out.println("Hello world!");
      }
    }
    ``` 
    
    Весь код выполнения задачи, кроме пункта 8, нужно писать вместо `System.out.println("Hello world!");`, эту строку нужно удалить:
    
    ```
      public static void main(String[] args) {
        System.out.println("Hello world!"); //Код сюда
      }
    ```


3. Создадим объект `Scanner scanner = new Scanner(System.in)`.


4. Добавим import для `Scanner` - `import java.util.Scanner`.


5. Создадим следующие переменные: 
    - `int totalTime = 0;` — для хранения общего времени на все задачи (изначально равно 0);
    - `int biggestTime = 0` — для хранения времени самой продолжительной задачи (изначально равно 0). Для первой задачи ее время выполнения всегда будет больше, чем `biggestTime`.
    - `int smallestTime = Integer.MAX_VALUE;` — для хранения времени самой короткой задачи, изначально равно максимальному значению integer(2147483647), так как мы еще не нашли самую короткую задачу. Для первой задачи ее время выполнение всегда будет меньше, чем изначальное значение `smallestTime`.


6. Создадим бесконечный цикл
    ```
    while (true){
        //пишем код с пунктов 7, 9, 10, 11, 12, 13, 14 здесь внутри цикла
    }
    ```

7. Внутри цикла последовательно выведем сообщения с просьбой ввода данных 
(дней, часов и минут), сохраним каждое значение в переменные: `days`, `hours`, `minutes`. Пример:
    ```
    System.out.println("Сколько дней потребуется на выполнение?");
    int days = scanner.nextInt();
    ```


8. Рядом с функцией `main` cоздадим специальную отдельную функцию для перевода дней, часов и минут в секунды.

    ```
    public static void main(String[] args) {
        //здесь код который вы уже написали
    }
      
    public static int convertToSeconds(int days, int hours, int minutes) {
        int seconds;
        // здесь нужно сделать подсчет секунд
        return seconds; 
    }
    
    ```

9. Переведем время текущей задачи в секунды и сохраним в переменную `currentTimeTask` (используя метод `convertToSeconds`).

    ```
    int currentTimeTask = convertToSeconds(days, hours, minutes);
    
    ```

10. Прибавим значение переменной `currentTimeTask` к переменной `totalTime`, то есть `totalTime +=currentTimeTask`, либо `totalTime = totalTime + currentTimeTask`.


11. Сравним значение переменной `currentTimeTask` со значением переменной `biggestTime`. Если значение `currentTimeTask` больше значения `biggestTime`, то присвоить значение `currentTimeTask` к `biggestTime`.


12. Сравним значение переменной `currentTimeTask` со значением переменной `smallestTime`. Если значение `currentTimeTask` меньше значения `smallestTime`, то присвоить значение `currentTimeTask` к `smallestTime`.


13. Выведем сообщение пользователю:

    ```
    System.out.println("Для завершения работы программы введите `end` для продолжения нажмите enter");
    ```
    

14. Проверим: если пользователь ввел `end`, завершим цикл:

    ```
    while (true){
        //здесь код написанный в ходе выполнения шагов 7, 9, 10, 11, 12, 13
        //...
        scanner.nextLine(); //при вызове nextLine() после nextInt() автоматически считается пустая строка, здесь мы ее игнорируем
        String input = scanner.nextLine(); //а здесь уже будет то, что реально ввел пользователь
        if ("end".equals(input)) {
            break;
        }
    }
    ```


15. После цикла выведем: 
    - сколько всего потребуется секунд на выполнение всех задач: 
        ```
        System.out.println("Всего потребуется:" +  totalTime + " секунд");
        ```
    - сколько времени займет самая короткая задача;
    - сколько времени займет самая продолжительная задача.
