# Домашнее задание к занятию 1.2. Основы синтаксиса - функции и циклы
## Задача 1. Перевод времени.

### Описание
Для работы менеджера задач, нам нужно сравнивать разные по длительности задачи.
Вам нужно разработать часть фунциональности, отвечающую за перевод времени из одних единиц в другие. Например – на одну задачу нужно 2 дня, 4 часа и 10 минут, на вторую задачу нужно 3 дня, 4 часа и 15 минут.
Хранить и использовать три переменные не удобно, поэтому для хранения времени обычно используют минимальную из используемых единиц. В нашем случае это секунды (хотя иногда используют миллисекунды).
Например задача занимает 1 день 2 часа 10 минут, а программа переводит и хранит это как 24\*3600\+2*3600\+10\*60=94200 секунд.
С одной переменной уже гораздо проще выполнять сравнение, сложение и вычитание.
Нужно написать программу которая в цикле запрашивает название задачи и ее продолжительность (3 числа: дни, часы и минуты), подсчитывает сколько времени потребуется на выполнение всех задач, а так же
выводит время в секундах самой продолжительной задачи и самой короткой.

### Функционал программы
1. Возможность ввода из консоли нескольких задач
    1. Название
    2. Количество дней
    3. Количество часов
    4. Количество минут
2. Завершение программы если пользователь ввел `end`
3. Перед завершением программы вести информацию:
    1. Всего потребуется секунд на выполнение всех задач
    2. Самая продолжительная задача займет XXXX секунд (имя задачи выводить не нужно)
    3. Самая короткая задача займет XXXX секунд (имя задачи выводить не нужно)

### Пример
```
Введите название задачи
"Дизайн главной страницы" <нажмите enter>
Сколько дней потребуется на выполнение?
3 <нажмите enter>
Сколько часов?
5 <нажмите enter>
Сколько минут?
0 <нажмите enter>
Для завершения работы программы введите `end` / для продолжения нажмите enter
...
Введите название задачи
"Верстка footer" <нажмите enter>
Сколько дней потребуется на выполнение?
0 <нажмите enter>
Сколько часов?
4 <нажмите enter>
Сколько минут?
0 <нажмите enter>
Для завершения работы программы введите `end` / для продолжения нажмите enter
end <нажмите enter>

Всего потребуется: 291600 секунд
Самая продолжительная задача займет: 277200
Самая короткая задача займет: 14400 секунд
```

### Реализация
1. Создадим новый replt.it как написано в инструкции к выполнению домашней работы и зададим название `homework1.2.1`
2. В файле `Main.java` написан следующий код
```
class Main {
  public static void main(String[] args) {
    System.out.println("Hello world!");
  }
}
``` 
Весь код выполнения задачи нужно писать вместо `System.out.println("Hello world!");`, эту строку нужно удалить
```
  public static void main(String[] args) {
    System.out.println("Hello world!"); //Код сюда
  }
```
3. Создадим объект `Scanner scanner = new Scanner(System.in)`
4. Создадим переменные для хранения общего времени на все задачи `totalTime`, `biggestTime` - время самой продолжительной задачи и
`smallestTime` - время самой короткой задачи.
4. Создадим цикл `while (true)` в котором, последоватольно выведем сообщения с просьбой ввода данных 
(дней, часов и минут), сохраним каждое значение в переменные: `int days, int hours, int minutes`
5. Создаим специальную отдельную функцию для перевода дней, часов и минут в секунды.
```
public static int convertToSeconds(int days, int hours, int minutes) {
    int seconds;
    ...
    return seconds; 
}
```
6. Переведем время текущей задачи в секунды и сохраним в переменную `currentTimeTask` (используя метод `convertToSeconds`)
7. Присвоим значение переменной `currentTimeTask` (время нашей первой задачи в секундах) ко всем трем переменным: `totalTime, biggestTime, smallestTime`
8. Выведем сообщение пользователю:
```
System.out.println("Для завершения работы программы введите `end` для продолжения нажмите enter");
```
9. Проверим если пользователь ввел `end` завершим цикл:
```
String input = scanner.nextLine();
if ("end".equals(input)) {
    break;
}
```
10. Выведем значение переменных:
```
System.out.println("Всего потребуется:" +  totalTime + " секунд");
...
```
11. Если пользователь нажал `enter` вместо  ввода `end`, повторить цикл ввода новой задачи в котором:
    - запросить ввод новой задачи
    - вычислить и сохранить время выполнения новой задачи в переменную `currentTimeTask`
    - прибавить значение переменной `currentTimeTask` к переменной `totalTime`
    - сравнить значение переменной `currentTimeTask` со значением переменной `biggestTime`, если значение `currentTimeTask` больше значения `biggestTime`, то присвоить значение `currentTimeTask` к `biggestTime`.
    - сравнить значение переменной `currentTimeTask` со значением переменной `smallestTime`, если значение `currentTimeTask` меньше значения `smallestTime`, то присвоить значение `currentTimeTask` к `smallestTime`.
    - вывести сообщение пользователю `System.out.println("Для завершения работы программы введите `end` для продолжения нажмите enter")`, прочитать введенное значение, в случае если пользователь ввел `end` выйти из цикла, вывести значения и завершить работу программы.
