## Задача 1. Сумматор

### Описание
Напишите программу для подсчета суммы 3х целых чисел. Операция суммирования уже считанных чисел должна быть вынесена в отдельный метод.

### Функционал программы
1. Ввод первого числа;
2. Ввод второго числа;
3. Ввод третьего числа;
4. Вывести на экран сумму этих чисел (через вызов отдельного метода суммирования).

### Пример
```
Программа расчета суммы трех чисел
Введите первое число:
10 <enter>
Введите второе число:
15 <enter>
Введите третье число:
20 <enter>
Сумма чисел = 45
```

### Реализация
1. Создадим новый repl на сайте [repl.it](https://repl.it/repls), как написано в инструкции к выполнению домашней работы.
2. В файле `Main.java` написан следующий код:

```java
class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}
``` 

Эту строку нужно удалить:

```java
System.out.println("Hello world!"); //Код сюда
```

3. Для вывода сообщений в консоль используется метод:

```java
System.out.println("Измените сообщение для вывода его в консоли");
```

4. Чтобы читать сообщения из консоли, воспользуемся специальным объектом `Scanner` (на следующих лекциях
мы подробнее познакомимся с термином объект). Описание `Scanner` (как ниже) делается только один раз на всю программу:

```java
Scanner scanner = new Scanner(System.in);
```

5. Для того чтобы была возможность в коде использовать класс `Scanner`, нужно обязательно добавить `import` этого класса 
в самое начало файла `Main.java`:

```java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        //Код сюда
    }
}
 ```

6. Чтобы прочитать введенное целое число из консоли, нужно написать:

```java
scanner.nextInt();
```

А чтобы прочитать и сохранить введенное значение в программе для дальнейшего использования, нужно написать:

```java
int value = scanner.nextInt();
```

7. Создадим метод, принимающий 3 целых числа в качестве аргументов. Назовем его `sum`, он будет складывать и возвращать сумму трех чисел:

```java
public static int sum(???) { // Замените ??? на недостающую часть программы
    return value1 + value2 + value3;
}
```

8. В методе `public static void main` запросим у пользователя ввести три числа, которые в дальнейшем передадим в качестве аргументов методу `sum`:

```java
Scanner scanner = new Scanner(System.in);
System.out.println("Введите первое число:");
int value1 = scanner.nextInt();
// Добавьте код для чтения еще 2х значений из консоли
``` 

9. После чтения значений вызовем метод `sum` для вычисления суммы:

```java
int result  = sum(value1, value2, value3);
```

10. Выведем результат на экран:

```
System.out.println("Сумма чисел = " + result);
```

11. Завершим работу программы.
