## Задача 2. Шифровальная машинка

### Описание
Нужно написать программу декодирования символов из восьмеричного ASCII кода.
Пользователь вводит восьмеричный код символа, который, далее декодируется в букву.
Для этого ввод надо считать как строку, превратить в int с через `Integer.parseInt` с указанием вторым параметром основания системы счисления откуда мы переводим и затем прикастить полученное int-овое значение к типу char.

### Функционал программы
1. Чтение символов;
2. Перевод символов из ASCII кода;
3. Вывод результата на экран.

### Пример 
```
Введите ASCII код (end для вывода результата):
150
Введите ASCII код (end для вывода результата):
151
Введите ASCII код (end для вывода результата):
end
Результат:
hi
...
```

### Процесс реализации
1. При запуске программы необходимо создать цикл, который будет запрашивать ввод данных пользователем.

2. Также нужно добавить условие выхода из цикла:
   - Если пользователь ввел `end` вместо кода символа и нажал <enter>, то завершим цикл ввода и выведем результат.
   ```
   //Создаем scanner - объект, который будет считывать из стандартного потока ввода/вывода (console)
   Scanner scanner = new Scanner(System.in);
   String input = "";
   String output = "";
   
   //Цикл будет работать, пока пользователь не введет `end`
   while (true) {       
       input = scanner.nextLine();
       if ("end".equals(input)) {
           break;
       }
       ???
       char c = ???
       output = output + c;
   }
   System.out.println(output);
   ```

3. При запуске программы запросите у пользователя ввод символа в восьмеричной системе. Пример: `Введите ASCII код (end для вывода результата):`.
   Для вывода сообщения в console достаточно использовать:
   ```
   System.out.println("Введите ASCII код (end для вывода результата):");
   ```

4. Последовательно в цикле запросите ввод кода каждого символа и преобразуйте его.

5. Выведите результат работы на экран.
