## Задача 1. ИПшник
**ВАЖНО:** Перед отправкой домашнего задания, убедитесь, что вы соблюдаете все правила форматирования кода: от правила именований, до пробелов и отступов (последнее можно исправлять автоматически в идее через Code -> Reformat code).

### Описание
Нужно написать программу-помощника индивидуальному предпринимателю (далее - ИП), которая помогает ему выбрать лучшую систему налогооблажения.
ИП будет заносить суммы доходов и расходов, а программа будет выбирать для него лучшую систему налогообложения из двух:
* УСН доходы - налог 6% от доходов;
* УСН доходы минус расходы - налог 15% от разницы доходов и расходов.

### Функционал программы
1. Ввод сумм доходов и расходов ИП;
2. ИП может несколько раз вносить доходы и расходы, они должны суммироваться с введёнными ранее данными;
3. При выборе ИП опции определения наиболее выгодной системы налогообложения, программа должна вывести название такой системы (`УСН доходы` или `УСН доходы минус расходы`);
4. При выводе самой выгодной системы налогооблажения, программа должна вывести также сумму, которую удастся сэкономить, если выбрать эту систему;
5. Программа должна завершаться при вводе слова `end`;
6. Нужно помнить, что налог не может быть отрицательным;
7. Программа должна быть структурирована в методы (например, расчёт налога для одной системы налогооблажения должен представлять собой отдельный статический метод)

### Пример 
```
Выберите операцию и введите её номер:
1. Добавить новый доход
2. Добавить новый расход
3. Выбрать ситему налогооблажения
1 <Enter>
Введите сумму дохода:
400 <Enter>

Выберите операцию и введите её номер:
1. Добавить новый доход
2. Добавить новый расход
3. Выбрать ситему налогооблажения
2 <Enter>
Введите сумму расхода:
100 <Enter>

Выберите операцию и введите её номер:
1. Добавить новый доход
2. Добавить новый расход
3. Выбрать ситему налогооблажения
1 <Enter>
Введите сумму дохода:
600 <Enter>

Выберите операцию и введите её номер:
1. Добавить новый доход
2. Добавить новый расход
3. Выбрать ситему налогооблажения
3 <Enter>

Мы советуем вам УСН доходы
Ваш налог составит: 60 рублей
Налог на другой системе: 135 рублей
Экономия: 75 рублей

Выберите операцию и введите её номер:
1. Добавить новый доход
2. Добавить новый расход
3. Выбрать ситему налогооблажения
end <Enter>

Программа завершена!
```

Такой вывод программы основан на следующих расчётах:
* Доходы ИП: 400 + 600 = 1000 рублей
* Расходы ИП: 100 рублей
* УСН доходы: 6% от 1000 рублей = 60 рублей
* УСН доходы минус расходы: 15% от 1000-100 рублей = 135 рублей
* Экономия: 135 - 60 = 75 рублей

### Процесс реализации
1. При запуске программы необходимо создать цикл, который будет запрашивать ввод данных пользователем.

2. Также нужно добавить условие выхода из цикла. Если пользователь ввел `end` вместо кода символа и нажал <enter>, то завершим цикл ввода и выведем результат:
   ```java
   //Создаем scanner - объект, который будет считывать из стандартного потока ввода/вывода (console)
   Scanner scanner = new Scanner(System.in);

   //Цикл будет работать, пока пользователь не введет `end`
   while (true) {     
       // Выводим информацию о возможных операциях пользователю
   
       String input = scanner.nextLine();
       if ("end".equals(input)) {
           break;
       }
       ...
   }
   System.out.println("Программа завершена!");
   ```

3. Заведите переменные для хранения доходов и расходов. При вводе новых доходов и расходов увеличивайте их на введённое число:
   ```java
      int earnings = 0;    // доходы
      int spendings = 0;   // расходы
   ```
   
3. Если пользователь ввёл номер операции, то превращаем текст в число и делаем по нему свич:
   ```java
   int operation = Integer.parseInt(input);
   switch (operation) {
      case 1:
         System.out.println("Введите сумму дохода:");
         String moneyStr = scanner.nextLine(); // Не используйте тут nextInt (!)
         int money = Integer.parseInt(moneyStr);
         earnings += money;
         break;
      case 2:
         // действия при выборе второй операции
         ...
         break;
      case 3::
         // действия при выборе второй операции
         ...
         break;
      default:
         System.out.println("Такой операции нет");
   }
   ```

4. Для каждой системы налогооблажения напишите метод, рассчитывающий налог. Не забудьте что налог отрицательным быть не может. Например, для УСН доходы минус расходы это будет выглядеть так:
   ```java
   public static int taxEarningsMinusSpendings(int earnings, int spendings) {
      int tax = (earnings - spendings) * 15 / 100;
      if (tax >= 0) {
         return tax;
      } else {
         // если расходы оказались больше, то налог посчитается отрицательным
         return 0;
      }
   }
   ```

5. В коде выбора лучшей системы налогооблажения рассчитайте налоги для каждой системы. Сравните полуенные значения, выберите условным оператором лучшую и выведите на экран всю необходимую ИП информацию.
   
5. Выведите результат работы на экран.
