# Домашнее задание к занятию 1.1. Основы синтаксиса - структура программы и условные операторы
## Задача 2. Проверить, пересекаются ли задачи во времени.

### Описание
Менеджер задач включает список задач на день, каждая задача имеет время старта и время окончания. 
Одновременно может выполняться только одна задача, поэтому задачи нужно проверять на пересечение времени выполнения.
Нужно написать программу проверки пересечения двух задач во времени (без учета минут). Будем считать, что введенные задачи выполняются в один день.

### Функционал программы
1. Вывод сообщения в консоли "Введите интервал первой задачи в формате `HH` и `HH`".
2. Прочитать значения и сохранить в переменные.
3. Вывод сообщения в коносли "Введите интервал второй задачи в формате `HH` и `HH`".
4. Прочитать значения и сохранить в переменные.
5. Рассчитать, пересекаются ли задачи, и вывести результат на экран. 

### Пример
Пример 1
```
Введите интервал первой задачи в формате "HH" и "HH"
12 16
Введите интервал второй задачи в формате "HH" и "HH"
14 18
Задачи пересекаются во времени!
```
Пример 2
```
Введите интервал первой задачи в формате "HH" и "HH"
11 13 <нажмите enter>
Введите интервал второй задачи в формате "HH" и "HH"
15 19 <нажмите enter>
Задачи не пересекаются во времени!
```

### Реализация
1. Создадим новый replt.it, как написано в инструкции к выполнению домашней работы, и зададим название `homework1.1.2`.
2. В файле `Main.java` написан следующий код:
```
class Main {
  public static void main(String[] args) {
    System.out.println("Hello world!");
  }
}
``` 
Весь код выполнения задачи нужно писать вместо `System.out.println("Hello world!");`:
```
  public static void main(String[] args) {
    System.out.println("Hello world!"); //Код сюда
  }
```
3. Для вывода сообщений в консоль используется метод `System.out.println`. Выведем первое сообщение "Введите интервал первой задачи в формате 'HH' и 'HH'":
```
System.out.println("Измените сообщение для вывода его в консоли");
```
4. Чтобы читать сообщения из консоли, воспользуемся специальным объектом `Scanner` (на следующих лекциях
мы подробнее познакомимся с термином объект), описание `Scanner` (как ниже) делается только один раз на всю программу.
```
Scanner scanner = new Scanner(System.in);
``` 
5. Для того чтобы была возможность в коде использовать класс `Scanner`, нужно обязательно добавить `import` этого класса 
в самое начало файла `Main.java`:
 ```
import java.util.Scanner;
  
public static void main(String[] args) {
    //Код сюда
}
 ```
6. Чтобы прочитать введенные числа, воспользуемся вызовом чтения числа из консоли:
```
int firstTaskHour1 = scanner.nextInt();
int firstTaskHour2 = scanner.nextInt();
```
7. Выведем второе сообщение "Введите интервал первой задачи в формате 'HH' и 'HH'":
```
System.out.println("Измените сообщение для вывода его в консоли");
```
8. Прочитаем значения и запишем в переменные:
```
int secondTaskHour1 = scanner.nextInt();
int secondTaskHour2 = scanner.nextInt();
```
9. Сравниваем значения начала и завершения задач с помощью оператора `if else`:
задачи не пересекаются если время завершения первой задачи меньше времени начала второй, иначе задачи пересекаются.
Для сравнения чисел используются следующие операторы сравнения: `>, <, <=, >=, !=`, например `value1 > value2`.
```
if (сравнить значение переменных используя) {
  //Вывод сообщения
} else {
  //Вывод сообщения
}
```
10. Завершение работы программы.
