## Задача 2. Вычисление разности переменных

### Описание
Нужно написать программу, которая будет вычитать из одной произвольной переменной - другую.

### Функционал программы
Вывести на экран разность двух целых чисел.

### Пример
```
15
```

### Реализация
1. Создать java проект в repl.it (как в первой задаче);

2. Объявить в коде две переменные типа `int` (можно указать вместо 195 и 210 любое другое значение на Ваше усмотрение):
    ```java
    class Main {
      public static void main(String[] args) {
        int value1 = 195; //переменная 1
        int value2 = 210; //переменная 2
        System.out.println(???); // Замените ??? на недостающую часть программы
      }
    }
    ```

3. Запустим программу нажав кнопку "Run", получим вывод в программы:
    ```
    15
    ``` 

4. Задача выполнена. Вы снова прекрасны!
