Домашнее задание по лекции 1.2. Основы синтаксиса - функции и циклы
==
Вы продолжаете работу над разработкой менеджера задач для разработчиков ([примеры приложений](https://netology.ru/blog/5-todo)). Выполните задачи для реализации различных функций.

## Задача 1. Перевод времени
### Описание
Для работы менеджера задач нам нужно сравнивать разные по длительности задачи.

Вам нужно разработать часть фунциональности, отвечающую за перевод времени из одних единиц в другие. Например – на одну задачу нужно 2 дня, 4 часа и 10 минут, на вторую задачу нужно 3 дня, 4 часа и 15 минут. Хранить и использовать три переменные не удобно, поэтому для хранения времени обычно используют минимальную из используемых единиц. В нашем случае это минуты. Например задача занимает 1 день 2 часа 10 минут, а программа переводит и хранит это как 24\*60\*1+60\*2+10=1570 минут. С одной переменной уже гораздо проще выполнять сравнение, сложение и вычитание.

Вам нужно написать программу, которая примет на ввод длительность задачи - 3 числа: число дней, минут и часов. Далее, вам нужно перевести введенное время в минуты. Потом запросить у пользователя в какую величину он хочет перевести результат: `дни`, `часы` или `минуты`, и вывести на экран длительность в соответствующем формате.

### Процесс реализации
1. Используя `Scanner scanner = new Scanner(System.in)` и `scanner.nexInt()` последовательно получить ввод трех чисел и сохранить их в переменные `int days`, `int hours`, `int minutes` для дней, часов и минут соответственно. Перед каждым запросом на ввод нужно выводить сообщение (`System.out.println("...");`), чтобы пользователь понимал, что ему вводить.
2. Создать переменную `int totalTimeMinutes`, вычислить и сохранить туда полное время задачи в минутах.
3. Создать 2 функции `public float convertToDays(int totalTimeMinutes)`, `public float convertToHours(int totalTimeMinutes)`.
4. Получить на ввод единицу измерения времени для вывода: `дни`, `часы` или `минуты`, и сохранить в переменную `String convertTo`.
5. Используя `switch(convertTo)` вызвать необходимую функцию и вывести длительность задачи в выбранном пользователем формате.

### Примеры
Пользователь вводит: 1, 5, 30, дни.

Вывод: 1.23

Пользователь вводит: 0, 0, 120, часы.

Вывод: 2.0


## Задача 2. Суммирование времени.
### Описание

Вы планируете задачи своей команды на неделю. При составлении задач для программиста необходимо следить за тем, чтобы его нагрузка не вышла за определенные рамки.

Для этого вам нужна программа, которая может вычислить суммарное время выполнения задач, общее количество которых заранее неизвестно. Пользователь будет поочередно вводить длительность задач в минутах. После ввода длительности последней задачи он введет `end`. После этого программа должна вывести суммарную длительность задач в минутах.

### Процесс реализации
1. Создать переменную, в которой будет храниться суммарная длительность задач и переменную `int totalTime`, в которой будут храниться вводимые пользователем значения `int inputString`.
2. Получить ввод длительности первой задачи.
3. Используя цикл `while` получить ввод длительности оставшихся задач. Для проверки на ввод `end` нужно использовать `inputString.equals("end")`, оператор `==` со строками не работает.
4. В цикле нужно привести введенную строку к числовому типу, и прибавить ее значение к переменной, в которой хранится суммарная длительность задач. Получить ввод нового значения в `inputString`.
5. После того как пользователь введет `end` и программа выйдет из цикла нужно вывести на экран суммарную длительность задач.

Не забывайте выводит понятные пользователю приглашения на ввод и сообщения при выводе данных на экран.

### Примеры
Пользователь вводит: 60, 120, 360, end.

Вывод: 540

## Задача 3. Калькулятор выплат по ипотеке.

Вы пишете кредитный калькулятор. Он должен рассчитывать сумму выплат по ипотеке за несколько лет.
Пользователь вводит сумму кредита, % по ипотеке, и срок займа.
Программа рассчитывает и выводит пользователю общую сумму, которую он заплатит банку.

Наш калькулятор работает так:
**Ежемесячный платеж = погашение суммы долга + процент за пользование.**

**Погашение суммы долга** происходит равными платежами. 

Например, при данных 6 млн на 120 мес: ежемесячная выплата 6 000 000/120 = 50 000

**Процент банку** рассчитывается, как (Общая сумма долга - Уплаченная сумма) \* Процент по кредиту за месяц.

Например, при 6 млн. и 9% годовых:
6 000 000\*0.09/12 = 45 000 - 1 месяц,
50 000\*0.09/12 = 375 - последний месяц

Соответственно, общая сумма, которую платит клиент банку в первый месяц - 95 000, в последний месяц - 50 375.

### Процесс реализации
1. Получить ввод трех чисел: сумма кредита, длительность в месяцах и процентная ставка.
2. Создать переменную для хранения общей суммы выплат.
3. Используя цикл `for` выполнить рассчеты за каждый месяц: вычислить сумму начисленных процентов и прибавить ее к общей сумме выплат, прибавить ежемесячный платеж к сумме выплат, вычесть ежемесячный платеж из оставшейся суммы кредита. В конце, оставшаяся сумма кредита дложна стать равна 0.
4. Вывести вычисленную общую сумму выплат на экран.

### Примеры
Пользователь вводит: 6000000, 0.09, 120.

Вывод: 8722500

Даже если вы знаете формулу, с помощью которой можно решить эту задачу без цикла, то не используйте её. :) Цель задания именно в тренировке использования цикла `for`.

## Инструкция по выполнению домашнего задания

1. Зарегистрируйтесь на сайте [Repl.IT](http://repl.it/).
2. Перейдите в раздел **my repls**.
3. Нажмите кнопку **Start coding now!**, если приступаете впервые, или **New Repl**, если у вас уже есть работы.
4. В списке языков выберите `Java`.
5. Код пишите в левой части окна, вместо строки `System.out.println("Hello world!");`.
6. Опирайтесь на принятый [стиль оформления кода](https://github.com/netology-code/codestyle/blob/master/java/README.md).
7. Посмотреть результат выполнения файла можно, нажав на кнопку **Run**. Результат появится в правой части окна.
8. После окончания работы нажмите кнопку **Share** и скопируйте ссылку из поля Share link.
9. В личном кабинете на сайте [netology.ru](http://netology.ru/) в поле комментария к домашней работе вставьте скопированную ссылку и отправьте работу на проверку.

*Никаких файлов прикреплять не нужно.*

