# Домашнее задание к занятию 4.2 Коллекции Queue
## Задача 1. Лифт

### Описание
Сегодня мы будем реализовывать программу для работы лифта 25-ти этажного дома.
Нужно написать программу, которая считывает данные из консоли, ожидая ввода номера этажа. После ввода каждого числа (номера этажа) добавляет значение в очередь. Как только пользователь введет 0, программа должна последовательно вывести список всех этажей, на которых лифт делал остановки, в формате: "этаж 1 -> этаж 22 -> этаж 0". 
Если пользователь ввел этаж вне диапазона 0-25, — проигнорировать ввод таких данных.

Для хранения введенных пользователем этажей подойдет структура на основе интерфейса очередь (queue).
По мере ввода мы сможем добавлять в конец очереди новые значения.

### Функционал программы
1. Ввод номеров этажей для остановки;
2. Вывод списка этажей на которых лифт делал остановки в формате: "этаж 1 -> этаж 22 -> этаж 0".

### Пример
```
Введите номер этажа:
1
Введите номер этажа:
5
Введите номер этажа:
8
Введите номер этажа:
0
Лифт останавливался на следующих этажах:
этаж 1 -> этаж 5 -> этаж 8 -> этаж 0"
```

### Реализация
1. Используя `Scanner scanner = new Scanner(System.in)` и `scanner.nextInt()`, в бесконечном цикле считывать номера этажей до тех пор, пока не будет введен нулевой этаж.
Например, так:
    ```java
      while (true) {
          
        //Сообщение для ввода данных
          
        int floor = scanner.nextInt();
          
        //Дополнительные проверки
          
        queue.add(floor);
      }
    ```
2. Перед каждым вводом необходимо запросить номер следующего этажа — вывести сообщение `System.out.println("Ожидаю ввода следующего этажа: (для завершения введите 0)")`, чтобы пользователь понимал, что ему вводить.
3. Далее нужно добавить проверку: если введенный этаж входит в диапазон допустимых значений 0-25, то продолжить работу программы; а если не входит, то вывести на экран сообщение: `System.out.println("Введен недопустимый этаж")`.
    ```java
      if (floor > 25) {
        continue;
      }
    ```
4. Добавить проверку: если введенный этаж = 0, нужно выйти из цикла "чтение данных из консоли".
    ```java
      if (floor == 0) {
        break;
      }
    ```
5. Если введенный этаж входит в диапазон 0-25, то нужно добавить значение в очередь и запросить ввод данных повторно.
6. Для вывода информации на экран, используя метод интерфейса `Queue poll`, необходимо прочитать последовательно все значения и вывести на экран.
Например, используя цикл:
    ```java
      while (!queue.isEmpty()) {
          Integer floor = queue.poll();  
          System.out.println("Этаж " + floor);
      }
    ```
### * Дополнительное задание: рассчитать время движения лифта. 
После ввода нулевого этажа, программа должна рассчитать время движения лифта вместе с остановками. Скорость движения лифта между парой этажей равна 5 секундам,
время остановки на открытие и закрытие дверей лифта — 10 секундам. Вам необходимо вывести информацию, сколько времени потребовалось лифту, чтобы пройти ранее введенные этажи.

### Реализация
1. Перед циклом вывода результата работы лифта нужно добавить несколько переменных:
`int waitDoorsInSeconds = 10` — количество секунд, которое потребуется на закрытие/открытие дверей;
`int waitMoveInSeconds = 5` — количество секунд, затрачиваемое лифтом на движение между этажами;
`int totalSeconds = 0` — всего потрачено времени на движение и остановки лифтом;
`int previouseFloor = -1` — переменная для хранения предыдущей остановки.
2. В цикле проверяем, если `previouseFloor` не равен `-1`, то вычисляем разницу между текущим этажом и предыдущим, и с 
помощью метода `Math.abs` найдем абсолютное значение (уберем знак) и умножим на время движения:
`totalSeconds += Math.abs(currentFloor - previouseFloor) * waitMoveInSeconds`
3. Добавим время открытия/закрытия дверей к `totalSeconds`:
`totalSeconds += waitDoorsInSeconds`
4. После выхода из цикла выведем значение переменной `totalSeconds` на экран.
`System.out.println("Время затраченное лифтом на маршрут =: " + totalSeconds + " с.")`.
5. Завершим работу программы.
