Домашнее задание к занятию 4.2. Коллекции. Очередь.
==

## Задача 1. Лифт
### Описание
Сегодня мы будем реализовывать программу для работы лифта 25-и этажного дома.

Нужно написать программу которая считывает данные из консоли ожидая ввода номера этажа, после ввода каждого числа (номера этажа)
добавляет значание в очередь, как только пользователь введет 0, программа последовательно выведет результат работы: список 
всех посещенных этажей в следующем формате: "этаж 1 -> этаж 22 -> этаж 0". 
Если пользователь ввел этаж вне диапазона 0-25 проигнорировать ввод таких данных.

Для реализации хранения введеных пользователем этажей отлично подойдет структура на основе интерфейса очередь (queue). По мере ввода
мы сможем добавлять в конец очереди новые значения.

### Процесс реализации

1. Используя `Scanner scanner = new Scanner(System.in)` и `scanner.nextInt()` в бесконечном цикле считывать номера этажей, до тех пор пока
не будет введен нулевой этаж.

Например так:
```
  while (true) {
      
    //Сообщение для ввода данных
      
    int floor = scanner.nextInt();
      
    //Дополнительные проверки
      
    queue.add(floor);      
  }
```

2. Перед каждый вводом, запросить номер следующего этажа - вывести сообщение `System.out.println("Ожидаю ввода следующего этажа: (для завершения введите 0)")`, чтобы пользователь понимал, что ему вводить.

3. Добавьте проверку, если введеный этаж входит в диапазон допустимых значений 0-25 продолжить работу программы, а если не входит вывести на экран сообщение: `System.out.println("Введен недопустимый этаж")`.
```
  if (floor > 25) {
    continue;
  }
```

4. Добавьте проверку, если введеный этаж = 0 нужно выйти из цилка чтение данных с консоли.
```
  if (floor == 0) {
    break;
  }
```

5. Если введеный этаж входит в диапазон 0-25 нужно добавить значение в очередь и запросить ввод данных снова.

6. Для вывода информации на экран используя метод интерфейса `Queue poll` прочитать последовательно все значения и вывести на экран.
Например используя цикл:
```
  while (!queue.isEmpty()) {
      Integer floor = queue.poll();  
      System.out.println("Этаж " + floor);
  }
```

### * Дополнительное задание: рассчитать время движения лифта. 

После ввода нулевого этажа, программа должна рассчитать время движения лифта вместе с остановками. Скорость движения лифта между парой этажей равна 5 секунд, 
время остановки на открытие и закрытие дверей лифта 10 секунд. Вывести информацию сколько времени потребовалось лифту чтобы пройти ранее веденные этажи.

### Процесс реализации

1. Перед циклом вывода результата работы лифта нужно добавить несколько перменных:
`int waitDoorsInSeconds = 10` - количество секунд которое потребуется на закрытия/открытия дверей
`int waitMoveInSeconds = 5` - количество секунд затрачиваемое лифтом на движение между этажами
`int totalSeconds = 0` - всего потраченно времени на движение и остановки лифтом
`int previouseFloor = -1` - пермеменная для хранения предыдущей остановки 

2. В цикле проверяем если `previouseFloor` не равен `-1`, вычисляем разницу между текущим этажем и предыдущим и с 
помощью метода `Math.abs` берем асболютное значение (убираем знак) и умножаем на время движения:
`totalSeconds += Math.abs(currentFloor - previouseFloor) * waitMoveInSeconds`

3. Добавить время открытия/закрытия дверей к `totalSeconds`:
`totalSeconds += waitDoorsInSeconds`

4. После выхода из цикла вывести значение переменной `totalSeconds` на экран.
`System.out.println("Время затраченное лифтом на маршрут =: " + totalSeconds + " с.")`.
5. Завершить работу программы.

## Инструкция по выполнению домашнего задания

1. Зарегистрируйтесь на сайте [Repl.IT](http://repl.it/).
2. Перейдите в раздел **my repls**.
3. Нажмите кнопку **Start coding now!**, если приступаете впервые, или **New Repl**, если у вас уже есть работы.
4. В списке языков выберите `Java`.
5. Код пишите в левой части окна, вместо строки `System.out.println("Hello world!");`.
6. Опирайтесь на принятый [стиль оформления кода](https://github.com/netology-code/codestyle/blob/master/java/README.md).
7. Посмотреть результат выполнения файла можно, нажав на кнопку **Run**. Результат появится в правой части окна.
8. После окончания работы нажмите кнопку **Share** и скопируйте ссылку из поля Share link.
9. В личном кабинете на сайте [netology.ru](http://netology.ru/) в поле комментария к домашней работе вставьте скопированную ссылку и отправьте работу на проверку.

*Никаких файлов прикреплять не нужно.*

Все задачи обязательны к выполнению для получения зачета. Присылать на проверку можно каждую задачу по отдельности или все задачи вместе. Во время проверки по частям ваша домашняя работа будет со статусом "На доработке".

Любые вопросы по решению задач задавайте в группе на Facebook.



