## Задача № 3

Написать программу, которая будет складывать, вычитать, умножать или делить два числа. Числа и знак операции вводятся пользователем. После выполнения вычисления программа не должна завершаться, а должна запрашивать новые данные для вычислений. Завершение программы должно выполняться при вводе символа '0' в качестве знака операции.

### Процесс реализации

Для решения этой задачи нам нужно создать цикл, в котором мы будем запрашивать числа на вход и тип операции. Для выхода из цикла нужно добавить проверку типа операции == 0, а после завершить программу.
1. Начнем с того, что запросим у пользователя числа, над которыми нужно провести операции, и саму операцию:
   - считаем первую переменную и запишем ее в `value1`;
   - считаем вторую переменную и запишем ее в `value2`.
2. Попросим пользователя ввести тип операции и записываем значение в переменную `operation`:
   - проверяем: если значение переменной = 0, выходим из цикла и завершаем работу программы;
   - добавляем блок `switch`, в котором в зависимости от значения переменной `operation` выполняем нужную арифметическую операцию и выводим результат вычисления на экран.
   
   ```
   Scanner scanner = new Scanner(System.in);
   String operation = "";
   double result = 0;
   
   while (true) {
       
       //Попросим пользователя ввести данные
       System.out.println("Введите два числа и тип операции (+,-,*,/)");
       
       //Считаем введеные значения и сохраним в переменные
       int value1 = scanner.nextInt();
       int value2 = scanner.nextInt();
       operation = scanner.next();
       
       //Выходим из цикла если операция равно нулю
       if ("0".equals(operation)) {
          break;
       }
       
       //Расчет результата
       switch (operation) {
         case "+" : result = value1 + value2;
           break;
         case "-" : result = value1 - value2;
           break;
         //TODO  
       }
       System.out.println("Результат операции = " + result);
   }

   ```
3. Запрашиваем ввод новых чисел для вычисления.
