Домашнее задание по лекции 1.1. Основы синтаксиса - структура программы и условные операторы
==
Вам необходимо выполнить и предоставить на проверку следующие задачи:

## Задача 1. Високосный год
### Описание

Создать функцию, вычисляющую количество дней в году.
В рамках нашего менеджера задач необходимо будет вычислять количество дней на задачу или проект. Это время зависит от количества дней в году.

Вам необходимо написать функцию, которая принимает на вход год в формате yyyy (например 2004).
На выход функция должна отдавать результат типа int: если год високосный, то 366, иначе 365.

Високосный год – это такой год, номер которого делится без остатка на 400, либо делится на 4 но не делится на 100.

### Реализация
1. Получить ввод из консоли, используя `Scanner scanner = new Scanner(System.in)`
2. Привести введенное число к типу int используя `Integer.parseInt()`
3. Проверить, високосный ли год
4. Вывести в консоль число дней, используя `System.out.println()`

## Задача 2. Проверить, пересекаются ли задачи во времени
### Описание

Создать функцию для проверки пересечения двух задач во времени.

Менеджер задач включает список задач на день, каждая задача имеет время старта и время окончания. Одновременно может выполняться только одна задача, поэтому задачи нужно проверять задачи на пересечение времени выполнения.

Принимаем, что задачи выполняются в один день.

На вход программе подается 4 аргумента: время начала первой задачи, время окончания первой задачи, время начала второй задачи, время окончания второй задачи

На выходе выводится boolean результат: пересекаются задачи или нет.


### Реализация
1. Получить ввод 4 чисел из консоли, используя `Scanner scanner = new Scanner(System.in)` и `Integer.parseInt()`
2. Создать переменную `boolean intersection`
3. Проверить пересекаются ли задачи и сохранить результат в `intersection`
4. Вывести переменную `intersection` на экран, используя `System.out.println()`

## Задача 3. Аутентификация пользователя
### Описание
Для работы в приложения необходимо реализовать аутентификацию пользователя по логину и паролю.

Программа хранит логин пользователя в переменной `username` и пароль в переменной `password`. Чтобы войти, пользователь вводит свои логин и пароль через консоль. Если они совпадают с сохраненными - программа выводит “Добро пожаловать!”, если не совпадают - “Неверный логин или пароль!”

### Реализация
1. Создать переменные `username` и `password` типа `String`, хранящие логин и пароль.
2. Получить ввод логина и пароля из консоли, используя `Scanner scanner = new Scanner(System.in)` и `Integer.parseInt()`
3. Сравнить введенные данные с хранящимися в программе. Для сравнения строк в Java используйте `.equals()`
4. Вывести результат на экран

***

## Инструкция по выполнению домашнего задания

1. Зарегистрируйтесь на сайте [Repl.IT](http://repl.it/).
2. Перейдите в раздел **my repls**.
3. Нажмите кнопку **Start coding now!**, если приступаете впервые, или **New Repl**, если у вас уже есть работы.
4. В списке языков выберите `Java`.
5. Код пишите в левой части окна, вместо строки `System.out.println("Hello world!");`.
6. Посмотреть результат выполнения файла можно, нажав на кнопку **Run**. Результат появится в правой части окна.
7. После окончания работы нажмите кнопку **Share** и скопируйте ссылку из поля Share link.
8. В личном кабинете на сайте [netology.ru](http://netology.ru/) в поле комментария к домашней работе вставьте скопированную ссылку и отправьте работу на проверку.

*Никаких файлов прикреплять не нужно.*
