Домашнее задание по лекции 1.1. Основы синтаксиса - структура программы и условные операторы
==
Вы работаете над разработкой менеджера задач для разработчиков ([примеры приложений](https://netology.ru/blog/5-todo)). Выполните задачи для реализации различных функций.

## Задача 1. Високосный год
### Описание

Создать функцию, вычисляющую количество дней в году.
В рамках нашего менеджера задач необходимо будет вычислять количество дней на задачу или проект. Это время зависит от количества дней в году.

Вам необходимо написать функцию, которая принимает на вход год в формате yyyy (например 2004).
На выход функция должна выводить результат в виде числа: если год високосный, то 366, иначе 365.

Високосный год – это такой год, номер которого делится без остатка на 400 (например 2000 или 2400), либо делится на 4 но не делится на 100 (например 2008, 2096, но не 2100).

Например, при вводе числа 2000, программа должна вывести `366`. При вводе 2018 – `365`

### Реализация
1. Получить на ввод номер года из консоли, используя `Scanner scanner = new Scanner(System.in)`.
2. Привести введенное число к типу int, используя `Integer.parseInt()`.
3. Проверить, високосный ли год. Для этого сначала надо проверить делимость на 400, используя `year % 400 == 0`. Если год делится на 400 без остатка, значит в нем точно 366 дней. Если нет, то аналогично проверить делимость на 100: если год делится на 100, то в нем точно 365 дней. И наконец, если год не делится ни на 400, ни на 100, то проверяем делимость на 4: если делится – то 366 дней, иначе 365.
4. Вывести в консоль число дней, используя `System.out.println()`.

## Задача 2. Проверить, пересекаются ли задачи во времени
### Описание

Создать функцию для проверки пересечения двух задач во времени.

Менеджер задач включает список задач на день, каждая задача имеет время старта и время окончания. Одновременно может выполняться только одна задача, поэтому задачи нужно проверять на пересечение времени выполнения.

Принимаем, что задачи выполняются в один день.

На вход программе подается 4 аргумента: время начала и окончания каждой задачи в часах (на этом этапе, для простоты не будем учитывать минуты). Время начала и окончания вводится в виде числа, например `13` (если задача начинается в 13 часов).

В результате на экран выводится результат типа `boolean`: пересекаются задачи или нет.

Например, для входных данных 1, 3, 5, 6 нужно вывести "Задачи не пересекаются!", а для 12, 16, 14, 18 или 12, 15, 10, 13: "Задачи пересекаются во времени!"


### Реализация
1. Поочередно получить ввод 4 чисел из консоли, используя `Scanner scanner = new Scanner(System.in)` и `Integer.parseInt()`. Для этого вам надо создать 4 переменных типа `int` и сохранить в каждую значание. Перед вводом каждого числа нужно отобразить приглашение на ввод, указывающее какое именно время требуется ввести, например `System.out.println("Введите время начала первой задачи:");`.
2. Создать переменную `boolean intersection`, в которую будет сохранен результат проверки задач на пересечение.
3. Проверить пересекаются ли задачи и сохранить результат в `intersection`.
4. Вывести результат на экран, используя `if (intersection)` и  `System.out.println()`.

## Задача 3. Аутентификация пользователя
### Описание
Для работы в приложения необходимо реализовать аутентификацию пользователя по логину и паролю.

Программа хранит логин пользователя в переменной `username` и пароль в переменной `password`. Чтобы войти, пользователь вводит свои логин и пароль через консоль. Если они совпадают с сохраненными - программа выводит “Добро пожаловать!”, если не совпадают - “Неверный логин или пароль!”

### Реализация
1. Создать переменные `username` и `password` типа `String`, и присвоить им какие-либо значения. Это будут сохраненные в программе логин и пароль, с которыми далее будем сравнивать пользовательский ввод.
2. Получить ввод логина и пароля из консоли, используя `Scanner scanner = new Scanner(System.in)` и `scanner.next()`.
3. Сравнить введенные данные с хранящимися в программе. Для сравнения строк в Java используйте `.equals()`.
4. Вывести на экран “Добро пожаловать!” или “Неверный логин или пароль!”, в зависимости от результата сравнения.

***

## Инструкция по выполнению домашнего задания

1. Зарегистрируйтесь на сайте [Repl.IT](http://repl.it/).
2. Перейдите в раздел **my repls**.
3. Нажмите кнопку **Start coding now!**, если приступаете впервые, или **New Repl**, если у вас уже есть работы.
4. В списке языков выберите `Java`.
5. Код пишите в левой части окна, вместо строки `System.out.println("Hello world!");`.
6. Опирайтесь на принятый [стиль оформления кода](https://github.com/netology-code/codestyle/blob/master/java/README.md).
7. Посмотреть результат выполнения файла можно, нажав на кнопку **Run**. Результат появится в правой части окна.
8. После окончания работы нажмите кнопку **Share** и скопируйте ссылку из поля Share link.
9. В личном кабинете на сайте [netology.ru](http://netology.ru/) в поле комментария к домашней работе вставьте скопированную ссылку и отправьте работу на проверку.

*Никаких файлов прикреплять не нужно.*

Все задачи обязательны к выполнению для получения зачета. Присылать на проверку можно каждую задачу по отдельности или все задачи вместе. Во время проверки по частям ваша домашняя работа будет со статусом "На переработке".

Любые вопросы по решению задач задавайте в группе на Facebook.
