## Задача 3. Вычисление периметра участка и его площади

### Описание
Напишите программу для вычисления периметра произвольного прямоугольного участка.
Напомним, периметр — это сумма длин сторон прямоугольника, рассчитывается по формуле: `2 * (a + b)`,
а площадь рассчитывается по формуле `a x b`.

### Функционал программы
1. Запросите пользователя ввести длину первой стороны;
2. Запросите пользователя ввести длину второй стороны;
3. Рассчитайте периметр участка;
4. Рассчитайте площадь участка;
5. Выведите на экран результат вычисления.

### Пример
Пример 1

```
Введите длину участка в метрах:
5 <enter>
Введите ширину участка в метрах:
6 <enter>
Периметр участка: 22 м.
Площадь участка: 30 м.кв.
```


Пример 2
```
Введите длину участка в метрах:
2 <enter>
Введите ширину участка в метрах:
8 <enter>
Периметр участка: 20 м.
Площадь участка: 16 м.кв.
```

### Реализация

1. Создадим новый repl на сайте [repl.it](https://repl.it/repls), как написано в инструкции к выполнению домашней работы.

2. В файле `Main.java` написан следующий код:

```java
class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}
``` 

Эту строку нужно удалить:

```java
System.out.println("Hello world!"); //Код сюда
```

3. Для вывода сообщений в консоль используется метод:

```java
System.out.println("Измените сообщение для вывода его в консоли");
```

4. Чтобы читать сообщения из консоли, воспользуемся специальным объектом `Scanner` (на следующих лекциях
мы подробнее познакомимся с термином объект). Описание `Scanner` (как ниже) делается только один раз на всю программу:

```java
Scanner scanner = new Scanner(System.in);
```

5. Для того чтобы была возможность в коде использовать класс `Scanner`, нужно обязательно добавить `import` этого класса 
в самое начало файла `Main.java`:

```java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        //Код сюда
    }
}
 ```

6. Чтобы прочитать введенную целое число из консоли, нужно написать:

```java
scanner.nextInt();
```

А чтобы прочитать и сохранить введенное значение в программе для дальнейшего использования, нужно написать:

```java
int value = scanner.nextInt();
```
7. Запросим у пользователя ввод длины участка и сохраним в переменную `length`:

```java
System.out.println("Введите длину участка в метрах:");
int length = scanner.nextInt();
```
8. Запросим у пользователя ввод ширины участка и сохраним в переменную `width`:

```java
System.out.println("Введите длину участка в метрах:");
int width = scanner.nextInt();
```
9. Напишем метод для рассчета периметра участка `calculatePerimeter` — этот метод будет принимать два целых числа на вход
(длину и ширину) и возвращать их сумму:

```java
static int calculatePerimeter(int length, int width) {
    return 2 * (length + width);
}
```

10. Напишем метод для расчета площади участка `calculateArea`, этот метод будет принимать также два целых числа на вход
(длину и ширину) и возвращать их произведение друг на друга:

```java
static int calculateArea(int length, int width) {
    return length * width;
}
``` 

11. В методе `public static void main` запросим у пользователя длину и ширину участка в метрах и передадим значения
в качестве аргументов методам `calculatePerimeter` и `calculateArea`:

```java
Scanner scanner = new Scanner(System.in);
System.out.println("Введите длину участка в метрах:");
int lenght = scanner.nextInt();
System.out.println("Введите ширину участка в метрах:");
int width = scanner.nextInt();

int perimeter = calculatePerimeter(length, width);
int area = calculateArea(length, width);
``` 

12. Выведем результат на экран:

```
System.out.println("Периметр участка: " + perimeter +  " м.");
System.out.println("Площадь участка: " + area +  " м.кв.");
```

11. Завершим работу программы.
