## Задача 1. Шифровальная машинка

### Описание
Нужно написать программу кодирования и декодирования символов из восьмеричного ASCII кода.
Для перевода таких смоволов можно воспользоваться таблицей симоволов http://www.asciitable.com (восьмеричный код Oct).

### Функционал программы
1. Чтение символов;
2. Перевод символов из ASCII кода;
3. Вывод результата на экран.

### Пример 
```
Введите ASCII код (end для вывода результата):
150
Введите ASCII код (end для вывода результата):
151
Введите ASCII код (end для вывода результата):
end
Результат:
hi
```

### Процесс реализации
1. При запуске программы необходимо создать цикл, который будет запрашивать ввод данных пользователем.

2. Также нудно добавить условие выхода из цикла:
   - Если пользователь ввел `end` вместо кода символа и нажал <enter>, то завершим цикл ввода и выведем результат.
   ```
   //Создаем scanner - объектор, который будет считывать из стандартного потока ввода/вывода (console)
   Scanner scanner = new Scanner(System.in);
   String input = "";
   
   //Цикл будет работать, пока пользователь не введет `end`
   while (!"end".equals(input)) {       
       input = scanner.nextLine();
       //TODO
   }
   ```

3. При запуске программы запросите у пользователя ввод символа в восьмеричной системе. Пример: `Введите ASCII код (end для вывода результата):`.
   Для вывода сообщения в console достаточно использовать:
   ```
   System.out.println("Введите ASCII код (end для вывода результата):");
   ```

4. Последовательно в цикле запросите ввод кода каждого символа и преобразуйте его.

5. Выведите результат работы на экран.
