# Домашнее задание к занятию 1.3 Типы данных в Java: примитивы
## Задача 1. Шифровальная машинка.

### Описание
Нужно написать программу кодирования и декодирования символов из восмиричного ASCII кода.
Для перевода таких смоволов можно воспользоваться таблицей симоволов http://www.asciitable.com (восмиричный код Oct)

### Функционал программы
1. Чтение символов
2. Перевод символов из ASCII кода
3. Вывод результат на экран

### Пример 
```
Введите ASCII код:
150
Введите ASCII код:
151

Результат:
hi
```

### Процесс реализации
1. При запуске программы создать цикл, который будет запрашивать ввод данных пользователем.
2. Добавить условие выхода из цикла:
   - Если пользователь ввел вместо названия задачи `end`, то завершаем цикл.
   ```
   //Создаем scanner - объектор, который будет считывать из стандартного потока ввода/вывода (console)
   Scanner scanner = new Scanner(System.in);
   String input = "";
   
   //Цикл будет работать, пока пользователь не введет `end`
   while (!"end".equals(input)) {
       //scanner.next() не подходит так как будет считывать каждое слово, а не всю строку целиком       
       input = scanner.nextLine();
       //TODO
   }
   ```
3. При запуске программы запросите у пользователя ввод символа в 8-и ричной системе. Пример: `Введите ASCII код`.
   Для вывода сообщения в console достаточно использовать:
   ```
   System.out.println("Введите ASCII код");
   ```
4. Последовательно в цикле запросите ввод кода каждого символа и преобрзауйте его.
5. Выведите результат работы на экран.
