# Домашнее задание к занятию 1.2. Основы синтаксиса - функции и циклы
## Задача 3. Планирование задач.

### Описание
У нас есть несколько участников команды: программист, дизайнер, тестировщик. Нужно написать программу, которая поможет запланировать, рассчитать нагрузку и задать для каждого участника задачи на неделю (не больше 40 часов).

### Функционал программы
Для каждого участника (программист, дизайнер, тестировщик) по очереди:
1. Ввести участника, для которого происходит планирование задач.
2. Запросить задачи в формате "Название и количество часов на задачу".
3. Посчитать количество уже введеных часов для участника. Если сумма превышает 40 часов, прекратить ввод.
4. Перейти к вводу задач для другого участника.

### Пример
```
Вас приветствует программа планировщик задач!
Давайте запланируем задачи на следующую неделю для команды.
Введите, для кого планируем?
Дизайнер <enter>
Введите название задачи:
Нарисовать макет сайта <enter>
Количество часов на задачу:
20 <enter>
Введите название задачи:
Нарисовать логотип для Петра Ивановича <enter>
Количество часов на задачу:
20 <enter>

Все 40 часов запланированы <enter>

Введите, для кого планируем?
Программист <enter>
Введите название задачи:
Продумать алгоритм работы менджера задач <enter>
Количество часов на задачу:
30 <enter>
Введите название задачи:
Написать менеджер задач <enter>
Количество часов на задачу:
5 <enter>
Введите название задачи:
Выложить программу в маркет <enter>
Количество часов на задачу:
10 <enter>

Задача слишком большая, нужно выбрать другую

Введите название задачи:
Помочь аналитику с документацией программы <enter>
Количество часов на задачу:
5 <enter>

Все 40 часов запланированы <enter>

Введите для кого планируем?
Тестировщик
...
Все 40 часов запланированы <enter>
<завершить работу программы>
```

### Реализация
1. Создадим новый repl.it, как написано в инструкции к выполнению домашней работы, и зададим название `homework1.2.3`.
2. В файле `Main.java` написан следующий код:
```
class Main {
  public static void main(String[] args) {
    System.out.println("Hello world!");
  }
}
``` 
Весь код выполнения задачи нужно писать вместо `System.out.println("Hello world!");`, эту строку нужно удалить.
```
  public static void main(String[] args) {
    System.out.println("Hello world!"); //Код сюда
  }
```
3. Создадим следующие переменные в методе `main`:
```
int team = 3; //программист, дизайнер, тестировщик - количество участников команды
int maxHours = 40; //максимальное количество рабочих часов для каждого участника команды
```
4. Выведем следующие сообщения в консоль
```
Вас приветствует программа планировщик задач!
Давайте запланируем задачи на следующую неделю для команды.
```
5. Создадим объект `Scanner scanner = new Scanner(System.in)` для чтения данных из консоли, чтобы не создавать этот объект в цикле.
6. Создадим первый цикл, ограниченный количеством участников.
```
for (int i = 0; i < team; i++) {
    //TODO
}
```
6. Выведем в этом первом цикле сообщение:
```
Введите для кого планируем?
```
7. Прочитаем введенное значение `scanner.nextLine()` (можно никуда не сохранять название, в этой задаче оно нам больше не потребуется).
8. Создадим перменную `int totalHours = 0`. В нее будем сохранять количество всех часов уже введенных задач для данного участника.
9. Создадим второй вложенный цикл `while`, условие выхода из которого будет `totalHours == 40` (если время задач участника больше 40 часов).
9. Во втором цикле по очереди выводим сообщения:
```
Введите название задачи:
Тест
Количество часов на задачу:
5
```
10 Прибавляем введенное значение к перменной `totalHours` (если значение после сложения больше 40) вернуть значение переменной `totalHours` к предыдущему и предложить ввести другую задачу.
11. Продолжать ввод, пока количество часов не достигнет 40 (`totalHours` == 40).
12. Выйти из вложенного цикла `while` и перейти к вводу задач для второго участника.
13. После ввода задач для всех участников команды завершить работу программы.

